Revit 2022 API
AnalyticalModelSurface.BottomExtensionPlaneId Property
 The bottom extension plane ID option.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2015
Syntax
C#
public ElementId BottomExtensionPlaneId { get; set; }
Visual Basic
Public Property BottomExtensionPlaneId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ BottomExtensionPlaneId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 Analytical model elements for walls support extension options, while those for floor or slabs do not. This Plane identifies a Level, a Grid, or a Ref Plane. To validate plane use [!:Autodesk::Revit::DB::Structure::AnalyticalModelSurface::isPlaneValidForExtension] method. To chcek if analytical model support extension use HasExtension property. If used on analytical model that do not support extension, exception InvalidOperationException will be thrown.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace